DataProcessors/ПодключениеАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодключениеАУСН</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/КлассификаторБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторБанков</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондентский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеятельностьПрекращена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СВИФТБИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКРКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКорпоративныхРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБанк</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаЗагружаетсяПоДепозитномуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЦифровогоСчета</Name>
					<Comment>Идентификатор счета цифрового рубля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПодключениеАУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет описание сервисов, чтобы отобразить их на форме.
// 
// Параметры:
//  ОписанияСервисов - ТаблицаЗначений - Описания сервисов, которые поддерживают обмен с АУСН
//
Процедура ЗаполнитьОписанияСервисов(ОписанияСервисов) Экспорт
	
	ОписанияСервисов.Очистить();
	
	БанкиНеПоддерживающиеПередачуНДФЛ = БанкиНеПоддерживающиеПередачуНДФЛ();
	МассивИдентификаторов = Новый Массив;
	Для Каждого Банк из БанкиАУСН() Цикл
		СтруктураНаименования = ОбщегоНазначенияБПКлиентСервер.РазложитьСтрокуНаименования(Банк.Наименование);
		ОписаниеСервиса = НовыйОписаниеСервиса();
		ОписаниеСервиса.ИмяСервиса = СтруктураНаименования.Наименование;
		Идентификатор = СокрЛП(СтрЗаменить(Банк.Идентификатор, "-", ""));
		Если МассивИдентификаторов.Найти(Идентификатор) <> Неопределено Тогда
			Идентификатор = СокрЛП(СтрЗаменить(Банк.Ссылка.УникальныйИдентификатор(), "-", ""));
		КонецЕсли;
		ОписаниеСервиса.ИмяЭлементов = Идентификатор;
		МассивИдентификаторов.Добавить(Идентификатор);
		ОписаниеСервиса.БИКБанка = Банк.БИК;
		ОписаниеСервиса.Сервис = Банк.Ссылка;
		Если БанкиНеПоддерживающиеПередачуНДФЛ.Найти(Банк.Ссылка) <> Неопределено Тогда
			ОписаниеСервиса.Описание = ОписаниеОбменаСБанками(Ложь);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОписанияСервисов.Добавить(), ОписаниеСервиса);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу с описанными возможностями сервисов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описанные возможности сервисов - см. НовыйТаблицаВозможностиСервисов()
//
Функция ОписанныеВозможностиСервисов() Экспорт
	
	ОписанныеСервисы = НовыйТаблицаВозможностиСервисов();
	
	// Особо опишем ФНС
	ФНС = НовыйВозможностиСервиса();
	ФНС.Сервис = Справочники.КлассификаторБанков.ПустаяСсылка();
	ФНС.ИмяСервиса         = "ФНС";
	ФНС.ИмяЭлементов       = "ФНС";
	ФНС.РазметкаОпераций   = Ложь;
	ЗаполнитьЗначенияСвойств(ОписанныеСервисы.Добавить(), ФНС);
	
	// Обработаем все банки АУСН
	БанкиНеПоддерживающиеПередачуНДФЛ = БанкиНеПоддерживающиеПередачуНДФЛ();
	МассивИдентификаторов = Новый Массив;
	Для Каждого Банк Из БанкиАУСН() Цикл
		ВозможностьСервиса = НовыйВозможностиСервиса();
		ВозможностьСервиса.Сервис     = Банк.Ссылка;
		ВозможностьСервиса.ИмяСервиса = Банк.Ссылка;
		Идентификатор = СокрЛП(СтрЗаменить(Банк.Идентификатор, "-", ""));
		Если МассивИдентификаторов.Найти(Идентификатор) <> Неопределено Тогда
			Идентификатор = СокрЛП(СтрЗаменить(Банк.Ссылка.УникальныйИдентификатор(), "-", ""));
		КонецЕсли;
		ВозможностьСервиса.ИмяЭлементов = Идентификатор;
		МассивИдентификаторов.Добавить(Идентификатор);
		Если БанкиНеПоддерживающиеПередачуНДФЛ.Найти(Банк.Ссылка) <> Неопределено Тогда
			ВозможностьСервиса.ПередачаНДФЛ = Ложь;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОписанныеСервисы.Добавить(), ВозможностьСервиса);
	КонецЦикла;
	
	Возврат ОписанныеСервисы;
	
КонецФункции

// Процедура заполняет описание сервисов, чтобы отобразить их на форме.
// 
// Параметры:
//  ВозможностиСервисов - ТаблицаЗначений - Возможности сервисов, которые поддерживают обмен с АУСН
//
Процедура ЗаполнитьВозможностиСервисов(ВозможностиСервисов) Экспорт
	
	ОписанныеСервисы = ОписанныеВозможностиСервисов();
	
	Для Каждого ОписаниеВозможностиСервиса Из ВозможностиСервисов Цикл
		СтруктураПоиска = Новый Структура("Сервис", ОписаниеВозможностиСервиса.Сервис);
		Строки = ОписанныеСервисы.НайтиСтроки(СтруктураПоиска);
		Если Строки.Количество() = 0 Тогда
			СтрокаЗаполнения = НовыйВозможностиСервиса();
		Иначе
			СтрокаЗаполнения = Строки[0];
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОписаниеВозможностиСервиса, СтрокаЗаполнения, , "Сервис, ИмяСервиса, ИмяЭлементов");
	КонецЦикла;
	
КонецПроцедуры

// Новый конструктор возможности сервиса.
// 
// Возвращаемое значение:
//  Структура - Новый возможности сервиса:
// * Сервис - СправочникСсылка.КлассификаторБанков
// * ИмяСервиса - Строка
// * ИмяЭлементов - Строка 
// * РазметкаОпераций - Булево 
// * РасчетНалога - Булево
// * ПлатежныеРеквизиты - Булево 
// * УведомленияОтФНС - Булево
// * ПередачаНДФЛ - Булево
//
Функция НовыйВозможностиСервиса() Экспорт
	
	ВозможностиСервиса = Новый Структура;
	ВозможностиСервиса.Вставить("Сервис",             Справочники.КлассификаторБанков.ПустаяСсылка());
	ВозможностиСервиса.Вставить("ИмяСервиса",         "");
	ВозможностиСервиса.Вставить("ИмяЭлементов",       "");
	ВозможностиСервиса.Вставить("РазметкаОпераций",   Истина);
	ВозможностиСервиса.Вставить("РасчетНалога",       Истина);
	ВозможностиСервиса.Вставить("ПлатежныеРеквизиты", Истина);
	ВозможностиСервиса.Вставить("УведомленияОтФНС",   Истина);
	ВозможностиСервиса.Вставить("ПередачаНДФЛ",       Истина);
	
	Возврат ВозможностиСервиса;
	
КонецФункции

// Возвращает описание сервиса.
// 
// Возвращаемое значение:
//  Структура - Описание сервиса:
// * ИмяСервиса - Строка - Используется в заголовке декораций
// * Описание - Строка - Описание обмена с сервисом. Описываются основные функции
// * ИмяЭлементов - Строка - Постфикс элементов для создания элементов на форме
// * ИмяКартинкиПодключено - Строка - Имя картинки, которую показываем когда обмен подключен
// * ИмяКартинкиНеПодключено - Строка - Имя картинки, которую показываем когда обмен не подключен
// * БИКБанка - Строка - Код банка, чтобы найти Банк по классификатору
// * Сервис - СправочникСсылка.КлассификаторБанков - Банк по классификатору
//
Функция НовыйОписаниеСервиса() Экспорт
	
	ОписаниеСервиса = Новый Структура;
	ОписаниеСервиса.Вставить("ИмяСервиса", "");
	ОписаниеСервиса.Вставить("Описание", ОписаниеОбменаСБанками());
	ОписаниеСервиса.Вставить("ИмяЭлементов", СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", ""));
	ОписаниеСервиса.Вставить("ИмяКартинкиПодключено", "ИнтеграцияАУСНПодключен");
	ОписаниеСервиса.Вставить("ИмяКартинкиНеПодключено", "СинхронизацияОтключена");
	ОписаниеСервиса.Вставить("БИКБанка", "");
	ОписаниеСервиса.Вставить("Сервис", Справочники.КлассификаторБанков.ПустаяСсылка());
	
	Возврат ОписаниеСервиса;
	
КонецФункции

// Возвращает массив банков, которые пока не поддерживают передачу НДФЛ.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КлассификаторБанков - Банки не поддерживающие передачу НДФЛ
//
Функция БанкиНеПоддерживающиеПередачуНДФЛ() Экспорт
	
	МассивБанков = Новый Массив;
	МассивБанков.Добавить(РаботаСБанкамиБП.СсылкаПоКлассификатору("044525092"));
	
	Возврат МассивБанков;
	
КонецФункции

// Возвращает банковский счет организации в указанном банке
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация
//   Банк - СправочникСсылка.КлассификаторБанков - Банк
//
// Возвращаемое значение:
//   СправочникСсылка.БанковскиеСчета - банковский счет организации
//
Функция БанковскийСчетОрганизации(Организация, Банк) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Банк", Банк);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Банки.Ссылка КАК Банк
	|ПОМЕСТИТЬ ВТ_Банки
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО КлассификаторБанков.Код = Банки.Код
	|		И КлассификаторБанков.КоррСчет = Банки.КоррСчет
	|ГДЕ
	|	КлассификаторБанков.Ссылка = &Банк
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Банки КАК ВТ_Банки
	|		ПО БанковскиеСчета.Банк = ВТ_Банки.Банк
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.БанковскийСчет;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает список банков из классификатора, используемых в банковских счетах организации
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, для которой формируется список банков
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.КлассификаторБанков - Список банков организации
//
Функция СписокБанковОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Банки.Код КАК Код,
	|	Банки.КоррСчет КАК КоррСчет
	|ПОМЕСТИТЬ ВТ_БанкиОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО БанковскиеСчета.Банк = Банки.Ссылка
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассификаторБанков.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_БанкиОрганизации КАК ВТ_БанкиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО ВТ_БанкиОрганизации.Код = КлассификаторБанков.Код
	|		И ВТ_БанкиОрганизации.КоррСчет = КлассификаторБанков.КоррСчет
	|		И НЕ КлассификаторБанков.ПометкаУдаления
	|		И НЕ КлассификаторБанков.ДеятельностьПрекращена";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеОбменаСБанками(ЕстьПередачаНДФЛ = Истина)
	
	Если ЕстьПередачаНДФЛ Тогда
		Возврат НСтр("ru = 'Обмен позволяет определять какие из операций относятся к налоговой базе АУСН и на какую сумму, а также позволяет передавать информацию о расчетах НДФЛ'");
	Иначе
		Возврат НСтр("ru = 'Обмен позволяет определять какие из операций относятся к налоговой базе АУСН и на какую сумму'");
	КонецЕсли;
	
КонецФункции

Функция БанкиАУСН()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанкиАУСН.Банк КАК Ссылка,
	|	КлассификаторБанков.Наименование,
	|	КлассификаторБанков.Код КАК БИК,
	|	БанкиАУСН.Идентификатор
	|ИЗ
	|	РегистрСведений.БанкиАУСН КАК БанкиАУСН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО БанкиАУСН.Банк = КлассификаторБанков.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НовыйТаблицаВозможностиСервисов()
	
	ТаблицаВозможностиСервисов = Новый ТаблицаЗначений;
	Для Каждого КлючИЗначение Из НовыйВозможностиСервиса() Цикл
		ТаблицаВозможностиСервисов.Колонки.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат ТаблицаВозможностиСервисов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
